; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob48) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate7)
	(at pallet1 depot1)
	(clear crate10)
	(at pallet2 depot2)
	(clear crate6)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear crate8)
	(at pallet6 distributor1)
	(clear crate5)
	(at pallet7 distributor1)
	(clear crate9)
	(at pallet8 distributor2)
	(clear crate1)
	(at pallet9 depot0)
	(clear crate2)
	(at pallet10 distributor1)
	(clear crate11)
	(at pallet11 distributor0)
	(clear pallet11)
	(at truck0 depot0)
	(at truck1 distributor1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot1)
	(available hoist6)
	(at hoist7 distributor0)
	(available hoist7)
	(at hoist8 distributor2)
	(available hoist8)
	(at hoist9 distributor1)
	(available hoist9)
	(at hoist10 distributor2)
	(available hoist10)
	(at crate0 distributor1)
	(on crate0 pallet7)
	(at crate1 distributor2)
	(on crate1 pallet8)
	(at crate2 depot0)
	(on crate2 pallet9)
	(at crate3 depot0)
	(on crate3 pallet0)
	(at crate4 distributor1)
	(on crate4 pallet6)
	(at crate5 distributor1)
	(on crate5 crate4)
	(at crate6 depot2)
	(on crate6 pallet2)
	(at crate7 depot0)
	(on crate7 crate3)
	(at crate8 distributor2)
	(on crate8 pallet5)
	(at crate9 distributor1)
	(on crate9 crate0)
	(at crate10 depot1)
	(on crate10 pallet1)
	(at crate11 distributor1)
	(on crate11 pallet10)
)

(:goal (and
		(on crate0 crate7)
		(on crate1 pallet6)
		(on crate3 pallet7)
		(on crate4 crate5)
		(on crate5 pallet3)
		(on crate6 pallet8)
		(on crate7 pallet4)
		(on crate8 pallet0)
		(on crate9 pallet1)
		(on crate10 pallet10)
		(on crate11 pallet11)
	)
))

; plan
1. (lift hoist8 crate1 pallet8 distributor2)
   deleted: (at crate1 distributor2) (clear crate1) (available hoist8) (on crate1 pallet8)
   added: (lifting hoist8 crate1) (clear pallet8)
   goals met: 0 of 11
2. (lift hoist6 crate10 pallet1 depot1)
   deleted: (at crate10 depot1) (clear crate10) (available hoist6) (on crate10 pallet1)
   added: (lifting hoist6 crate10) (clear pallet1)
   goals met: 0 of 11
3. (lift hoist9 crate11 pallet10 distributor1)
   deleted: (at crate11 distributor1) (clear crate11) (available hoist9) (on crate11 pallet10)
   added: (lifting hoist9 crate11) (clear pallet10)
   goals met: 0 of 11
4. (load hoist9 crate11 truck1 distributor1)
   deleted: (lifting hoist9 crate11)
   added: (in crate11 truck1) (available hoist9)
   goals met: 0 of 11
5. (lift hoist2 crate6 pallet2 depot2)
   deleted: (at crate6 depot2) (clear crate6) (available hoist2) (on crate6 pallet2)
   added: (lifting hoist2 crate6) (clear pallet2)
   goals met: 0 of 11
6. (lift hoist4 crate5 crate4 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist4) (on crate5 crate4)
   added: (lifting hoist4 crate5) (clear crate4)
   goals met: 0 of 11
7. (lift hoist5 crate8 pallet5 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist5) (on crate8 pallet5)
   added: (lifting hoist5 crate8) (clear pallet5)
   goals met: 0 of 11
8. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 0 of 11
9. (load hoist8 crate1 truck1 distributor2)
   deleted: (lifting hoist8 crate1)
   added: (in crate1 truck1) (available hoist8)
   goals met: 0 of 11
10. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 0 of 11
11. (load hoist4 crate5 truck1 distributor1)
   deleted: (lifting hoist4 crate5)
   added: (in crate5 truck1) (available hoist4)
   goals met: 0 of 11
12. (lift hoist4 crate9 crate0 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist4) (on crate9 crate0)
   added: (lifting hoist4 crate9) (clear crate0)
   goals met: 0 of 11
13. (load hoist4 crate9 truck1 distributor1)
   deleted: (lifting hoist4 crate9)
   added: (in crate9 truck1) (available hoist4)
   goals met: 0 of 11
14. (unload hoist9 crate1 truck1 distributor1)
   deleted: (in crate1 truck1) (available hoist9)
   added: (lifting hoist9 crate1)
   goals met: 0 of 11
15. (drive truck1 distributor1 depot1)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot1)
   goals met: 0 of 11
16. (load hoist6 crate10 truck1 depot1)
   deleted: (lifting hoist6 crate10)
   added: (in crate10 truck1) (available hoist6)
   goals met: 0 of 11
17. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 0 of 11
18. (unload hoist7 crate11 truck1 distributor0)
   deleted: (in crate11 truck1) (available hoist7)
   added: (lifting hoist7 crate11)
   goals met: 0 of 11
19. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 0 of 11
20. (drop hoist7 crate11 pallet11 distributor0)
   deleted: (lifting hoist7 crate11) (clear pallet11)
   added: (available hoist7) (at crate11 distributor0) (clear crate11) (on crate11 pallet11)
   goals met: 1 of 11
21. (drive truck1 distributor1 depot1)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot1)
   goals met: 1 of 11
22. (unload hoist6 crate9 truck1 depot1)
   deleted: (in crate9 truck1) (available hoist6)
   added: (lifting hoist6 crate9)
   goals met: 1 of 11
23. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 1 of 11
24. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 1 of 11
25. (drop hoist6 crate9 pallet1 depot1)
   deleted: (lifting hoist6 crate9) (clear pallet1)
   added: (available hoist6) (at crate9 depot1) (clear crate9) (on crate9 pallet1)
   goals met: 2 of 11
26. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   goals met: 2 of 11
27. (load hoist2 crate6 truck0 depot2)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck0) (available hoist2)
   goals met: 2 of 11
28. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   goals met: 2 of 11
29. (unload hoist8 crate6 truck0 distributor2)
   deleted: (in crate6 truck0) (available hoist8)
   added: (lifting hoist8 crate6)
   goals met: 2 of 11
30. (load hoist5 crate8 truck0 distributor2)
   deleted: (lifting hoist5 crate8)
   added: (in crate8 truck0) (available hoist5)
   goals met: 2 of 11
31. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 2 of 11
32. (drop hoist8 crate6 pallet8 distributor2)
   deleted: (lifting hoist8 crate6) (clear pallet8)
   added: (available hoist8) (at crate6 distributor2) (clear crate6) (on crate6 pallet8)
   goals met: 3 of 11
33. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 3 of 11
34. (unload hoist7 crate5 truck1 distributor0)
   deleted: (in crate5 truck1) (available hoist7)
   added: (lifting hoist7 crate5)
   goals met: 3 of 11
35. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 3 of 11
36. (drop hoist7 crate5 pallet3 distributor0)
   deleted: (lifting hoist7 crate5) (clear pallet3)
   added: (available hoist7) (at crate5 distributor0) (clear crate5) (on crate5 pallet3)
   goals met: 4 of 11
37. (lift hoist0 crate7 crate3 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate3)
   added: (lifting hoist0 crate7) (clear crate3)
   goals met: 4 of 11
38. (load hoist0 crate7 truck0 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck0) (available hoist0)
   goals met: 4 of 11
39. (lift hoist0 crate3 pallet0 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 pallet0)
   added: (lifting hoist0 crate3) (clear pallet0)
   goals met: 4 of 11
40. (load hoist0 crate3 truck0 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck0) (available hoist0)
   goals met: 4 of 11
41. (unload hoist0 crate8 truck0 depot0)
   deleted: (in crate8 truck0) (available hoist0)
   added: (lifting hoist0 crate8)
   goals met: 4 of 11
42. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 4 of 11
43. (drop hoist0 crate8 pallet0 depot0)
   deleted: (lifting hoist0 crate8) (clear pallet0)
   added: (available hoist0) (at crate8 depot0) (clear crate8) (on crate8 pallet0)
   goals met: 5 of 11
44. (unload hoist4 crate7 truck0 distributor1)
   deleted: (in crate7 truck0) (available hoist4)
   added: (lifting hoist4 crate7)
   goals met: 5 of 11
45. (load hoist9 crate1 truck1 distributor1)
   deleted: (lifting hoist9 crate1)
   added: (in crate1 truck1) (available hoist9)
   goals met: 5 of 11
46. (drop hoist4 crate7 pallet4 distributor1)
   deleted: (lifting hoist4 crate7) (clear pallet4)
   added: (available hoist4) (at crate7 distributor1) (clear crate7) (on crate7 pallet4)
   goals met: 6 of 11
47. (unload hoist9 crate10 truck1 distributor1)
   deleted: (in crate10 truck1) (available hoist9)
   added: (lifting hoist9 crate10)
   goals met: 6 of 11
48. (drop hoist9 crate10 pallet10 distributor1)
   deleted: (lifting hoist9 crate10) (clear pallet10)
   added: (available hoist9) (at crate10 distributor1) (clear crate10) (on crate10 pallet10)
   goals met: 7 of 11
49. (lift hoist9 crate0 pallet7 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist9) (on crate0 pallet7)
   added: (lifting hoist9 crate0) (clear pallet7)
   goals met: 7 of 11
50. (drop hoist9 crate0 crate7 distributor1)
   deleted: (lifting hoist9 crate0) (clear crate7)
   added: (available hoist9) (at crate0 distributor1) (clear crate0) (on crate0 crate7)
   goals met: 8 of 11
51. (unload hoist9 crate1 truck1 distributor1)
   deleted: (in crate1 truck1) (available hoist9)
   added: (lifting hoist9 crate1)
   goals met: 8 of 11
52. (lift hoist4 crate4 pallet6 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist4) (on crate4 pallet6)
   added: (lifting hoist4 crate4) (clear pallet6)
   goals met: 8 of 11
53. (load hoist4 crate4 truck0 distributor1)
   deleted: (lifting hoist4 crate4)
   added: (in crate4 truck0) (available hoist4)
   goals met: 8 of 11
54. (unload hoist4 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist4)
   added: (lifting hoist4 crate3)
   goals met: 8 of 11
55. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 8 of 11
56. (unload hoist7 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist7)
   added: (lifting hoist7 crate4)
   goals met: 8 of 11
57. (drop hoist9 crate1 pallet6 distributor1)
   deleted: (lifting hoist9 crate1) (clear pallet6)
   added: (available hoist9) (at crate1 distributor1) (clear crate1) (on crate1 pallet6)
   goals met: 9 of 11
58. (drop hoist4 crate3 pallet7 distributor1)
   deleted: (lifting hoist4 crate3) (clear pallet7)
   added: (available hoist4) (at crate3 distributor1) (clear crate3) (on crate3 pallet7)
   goals met: 10 of 11
59. (drop hoist7 crate4 crate5 distributor0)
   deleted: (lifting hoist7 crate4) (clear crate5)
   added: (available hoist7) (at crate4 distributor0) (clear crate4) (on crate4 crate5)
   goals met: 11 of 11
